### Heroes Of Pymoli Data Analysis
* Of the 576 active players, the majority are male (84.03%), with female players accounting for 14.06%. 

* A large proportion of players fall within the 20-24 age group (44.79%), followed by the 15-19 age group (18.58%) and then followed by the 25-29 age group (13.37%).  

* Purchasing trends are in line with the age demographics of active players, with the most purchases falling within the 20-24 age group at 365 total purchases totaling \\$1,114.06. Within the 15-19 age group, 136 total purchases were made totaling \\$412.89, and within the 25-29 age group, 101 total purchases were made totaling \\$293. 

* The most popular item sold is "Final Critic," with 13 sold totaling \\$59.99 in sales. The next most popular item is "Oathbreaker, Last Hope of the Breaking Storm," with 12 sold totaling \\$50.76. 

* Male players made the most purchases with 652 purchases totaling \\$1967.64; females made 113 purchases totaling \\$361.94.
-----

In [1]:
import pandas as pd

# Filepath
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load, encoding="utf-8")
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [2]:
# Get total number of players by getting the number of unique players
total_players = len(purchase_data["SN"].unique())
total_players = pd.DataFrame({"Total Players": [total_players]})
total_players

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [3]:
# Get number of unique items
unique_items = len(purchase_data["Item Name"].unique())
unique_items

179

In [4]:
# Get average price of all items
average_price = purchase_data["Price"].mean()
average_price

3.050987179487176

In [5]:
# Get sum of all purchases
sum_price = purchase_data["Price"].sum()
sum_price

2379.77

In [6]:
# Get total purchases
number_of_purchases = len(purchase_data["Purchase ID"])
number_of_purchases

780

In [7]:
# Convert purchasing summary to DataFrame with formats
purchasing_summary_total = pd.DataFrame({"Number of Unique Items": [unique_items], 
                                        "Average Price": [average_price], 
                                        "Number of Purchases": [number_of_purchases], 
                                        "Total Revenue": [sum_price]})
purchasing_summary_total["Average Price"] = purchasing_summary_total["Average Price"].map("${:.2f}".format)
purchasing_summary_total["Total Revenue"] = purchasing_summary_total["Total Revenue"].map("${:.2f}".format)
purchasing_summary_total

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780      $2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [8]:
# Extract columns for gender summary
gender_sum = purchase_data[["SN", "Gender"]]

# Drop duplicate SN to get total gender counts
gender_analysis = gender_sum.drop_duplicates()
gender_analysis.count()

SN        576
Gender    576
dtype: int64

In [9]:
# Get counts of each gender 
gender_count = gender_analysis["Gender"].value_counts()
gender_count = pd.DataFrame(gender_count)
gender_count

                       Gender
Male                      484
Female                     81
Other / Non-Disclosed      11

In [10]:
# Get percentages of each gender
gender_summary = (gender_count["Gender"]/576).map("{:,.2%}".format)
gender_summary

Male                     84.03%
Female                   14.06%
Other / Non-Disclosed     1.91%
Name: Gender, dtype: object

In [11]:
# Combine columns and verify numbers
gender_count["Percentage of Players"] = gender_summary

# Rename gender count column
gender_demographics = gender_count.rename(columns={"Gender": "Total Count"})
gender_demographics

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [12]:
# Get purchase count by males
male_purchase_df = purchase_data.loc[purchase_data["Gender"] == "Male", :]
male_purchase_count = len(male_purchase_df)
male_purchase_count

652

In [13]:
# Sum up total purchases by males
male_purchase_total = male_purchase_df["Price"].sum()
male_purchase_total

1967.64

In [14]:
# Get the average purchase price for males
male_avg_purchase = male_purchase_df["Price"].mean()
male_avg_purchase

3.0178527607361953

In [15]:
# Get average male total purchase per unique person
# First, get the total number of male purchasers
male_sum = gender_analysis.loc[gender_analysis["Gender"] == "Male", :]
male_total = len(male_sum)

# Then divide male total purchases by the number of male purchasers
male_purchase_pp = male_purchase_total/male_total
male_purchase_pp

4.065371900826446

In [16]:
# Get purchase count by females
female_purchase_df = purchase_data.loc[purchase_data["Gender"] == "Female", :]
female_purchase_count = len(female_purchase_df)
female_purchase_count

113

In [17]:
# Sum up total purchases by females
female_purchase_total = female_purchase_df["Price"].sum()
female_purchase_total

361.94

In [18]:
# Get the average purchase price for females
female_avg_purchase = female_purchase_df["Price"].mean()
female_avg_purchase

3.203008849557519

In [19]:
# Get average female total purchase per unique person
# First, get the total number of female purchasers
female_sum = gender_analysis.loc[gender_analysis["Gender"] == "Female", :]
female_total = len(female_sum)

# Then divide male total purchases by the number of female purchasers
female_purchase_pp = female_purchase_total/female_total
female_purchase_pp

4.468395061728395

In [20]:
# Get purchase count by 'other/non-disclosed'
other_purchase_df = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]
other_purchase_count = len(other_purchase_df)
other_purchase_count

15

In [21]:
# Sum up total purchases by 'other/non-disclosed'
other_purchase_total = other_purchase_df["Price"].sum()
other_purchase_total

50.19

In [22]:
# Get the average purchase price for 'other/non-disclosed'
other_avg_purchase = other_purchase_df["Price"].mean()
other_avg_purchase

3.3460000000000005

In [23]:
# Get average 'other/non-disclosed' total purchase per unique person
# First, get the total number of 'other/non-disclosed' purchasers
other_sum = gender_analysis.loc[gender_analysis["Gender"] == "Other / Non-Disclosed", :]
other_total = len(other_sum)

# Then divide male total purchases by the number of female purchasers
other_purchase_pp = other_purchase_total/other_total
other_purchase_pp

4.5627272727272725

In [24]:
# Convert gender purchasing summary to DataFrame
purchasing_analysis = pd.DataFrame({"Purchase Count": [male_purchase_count, female_purchase_count, other_purchase_count],
                                   "Average Purchase Price": [male_avg_purchase, female_avg_purchase, other_avg_purchase],
                                   "Total Purchase Value": [male_purchase_total, female_purchase_total, other_purchase_total],
                                   "Avg Total Purchase per Person": [male_purchase_pp, female_purchase_pp, other_purchase_pp]
                                   },
                                   index=["Male", "Female", "Other"])
# Format columns
purchasing_analysis["Average Purchase Price"] = purchasing_analysis["Average Purchase Price"].map("${:.2f}".format)
purchasing_analysis["Total Purchase Value"] = purchasing_analysis["Total Purchase Value"].map("${:.2f}".format)
purchasing_analysis["Avg Total Purchase per Person"] = purchasing_analysis["Avg Total Purchase per Person"].map("${:.2f}".format)
purchasing_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Male,652,$3.02,$1967.64,$4.07
Female,113,$3.20,$361.94,$4.47
Other,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [25]:
# Get min and max age
print(purchase_data["Age"].max())
print(purchase_data["Age"].min())

45
7

In [26]:
# Create bins for ages
bins = [0, 9, 14, 19, 24, 29, 34, 39, 50]

# Create labels for bins
group_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [27]:
# Slice data and place into bins
pd.cut(purchase_data["Age"], bins, labels=group_labels).head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [28]:
# Input Age Group series as new column inside the DataFrame
purchase_data["Age Group"] = pd.cut(purchase_data["Age"], bins, labels=group_labels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [29]:
# Create groupby object based on Age Group
# Get count within each group
age_group = purchase_data.groupby("Age Group")
print(age_group["Age"].count())

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Age, dtype: int64

In [30]:
# Extract columns for age summary
age_count = purchase_data[["SN", "Age", "Age Group"]]

# Drop duplicate SN to get info on age of each player only
age_analysis = age_count.drop_duplicates()
age_analysis.head()

              SN  Age Age Group
0        Lisim78   20     20-24
1    Lisovynya38   40       40+
2     Ithergue48   24     20-24
3  Chamassasya86   24     20-24
4      Iskosia90   23     20-24

In [31]:
# Get new count within each Age Group
age_group = age_analysis.groupby("Age Group")
print(age_group["Age"].count())

Age Group
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: Age, dtype: int64

In [32]:
# Create table with count within each Age Group
age_summary = age_group[["Age"]].count()
age_total = age_summary.rename(columns={"Age": "Total Count"})
age_total

           Total Count
Age Group
<10                 17
10-14               22
15-19              107
20-24              258
25-29               77
30-34               52
35-39               31
40+                 12

In [33]:
# Get percentage of each age group and add formats
age_percent = (age_summary["Age"]/576).map("{:,.2%}".format)
age_percent

Age Group
<10       2.95%
10-14     3.82%
15-19    18.58%
20-24    44.79%
25-29    13.37%
30-34     9.03%
35-39     5.38%
40+       2.08%
Name: Age, dtype: object

In [34]:
# Combine Age Group "total count" and "percentage" to create table with summary of age demographics
age_total["Percentage of Players"] = age_percent
age_total

           Total Count Percentage of Players
Age Group
<10                 17                 2.95%
10-14               22                 3.82%
15-19              107                18.58%
20-24              258                44.79%
25-29               77                13.37%
30-34               52                 9.03%
35-39               31                 5.38%
40+                 12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [35]:
# Grab binning work from above and count the number of purchases per age group
purchases_df = purchase_data.groupby("Age Group")
purchase_count = purchases_df["Purchase ID"].count()
purchase_count

Age Group
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [36]:
# Get the average purchase price for each age group
avg_purchase_price = purchases_df["Price"].mean()
avg_purchase_price

Age Group
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [37]:
# Get total purchases for each age group
total_purchases = purchases_df["Price"].sum()
total_purchases

Age Group
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [38]:
age_total.dtypes

Total Count               int64
Percentage of Players    object
dtype: object

In [39]:
# Get average purchase price per person in each age group
# Convert count in each age group to float
age_total["Total Count"] = age_total.loc[:, "Total Count"] = age_total["Total Count"].astype(float)

# Divide total purchases in each age group by the number of unique individuals
avg_purchase_pp = total_purchases/age_total["Total Count"]
avg_purchase_pp = pd.DataFrame(avg_purchase_pp)
avg_purchase_pp

                  0
Age Group
<10        4.537059
10-14      3.762727
15-19      3.858785
20-24      4.318062
25-29      3.805195
30-34      4.115385
35-39      4.763548
40+        3.186667

In [40]:
avg_purchase_pp.dtypes

0    float64
dtype: object

In [41]:
# Merge columns two at a time using analyses
purchases_by_age = pd.merge(purchase_count, avg_purchase_price, on="Age Group")
purchases_by_age

           Purchase ID     Price
Age Group
<10                 23  3.353478
10-14               28  2.956429
15-19              136  3.035956
20-24              365  3.052219
25-29              101  2.900990
30-34               73  2.931507
35-39               41  3.601707
40+                 13  2.941538

In [42]:
purchases_by_age2 = pd.merge(purchases_by_age, total_purchases, on="Age Group")
purchases_by_age2

           Purchase ID   Price_x  Price_y
Age Group
<10                 23  3.353478    77.13
10-14               28  2.956429    82.78
15-19              136  3.035956   412.89
20-24              365  3.052219  1114.06
25-29              101  2.900990   293.00
30-34               73  2.931507   214.00
35-39               41  3.601707   147.67
40+                 13  2.941538    38.24

In [43]:
# Final merging of columns
purchases_by_age3 = pd.merge(purchases_by_age2, avg_purchase_pp, on="Age Group", how="left")
purchases_by_age3

           Purchase ID   Price_x  Price_y         0
Age Group
<10                 23  3.353478    77.13  4.537059
10-14               28  2.956429    82.78  3.762727
15-19              136  3.035956   412.89  3.858785
20-24              365  3.052219  1114.06  4.318062
25-29              101  2.900990   293.00  3.805195
30-34               73  2.931507   214.00  4.115385
35-39               41  3.601707   147.67  4.763548
40+                 13  2.941538    38.24  3.186667

In [44]:
# Rename columns
age_group_purchases = purchases_by_age3.rename(columns={"Purchase ID": "Purchase Count", 
                                                      "Price_x": "Avg Purchase Price",
                                                      "Price_y": "Total Purchase Value",
                                                      0: "Avg Total Purchase per Person"})
# Format columns
age_group_purchases["Avg Purchase Price"] = age_group_purchases["Avg Purchase Price"].map("${:.2f}".format)
age_group_purchases["Total Purchase Value"] = age_group_purchases["Total Purchase Value"].map("${:.2f}".format)
age_group_purchases["Avg Total Purchase per Person"] = age_group_purchases["Avg Total Purchase per Person"].map("${:.2f}".format)
age_group_purchases

,Purchase Count,Avg Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Group,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,$1114.06,$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [45]:
# To get info on top spenders, first group by SN and then get the counts of purchases for each player
spend_df = purchase_data.groupby("SN")
spend_count = spend_df["Purchase ID"].count()
spend_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [46]:
# Sum up total spending for each player
spend_total = spend_df["Price"].sum()
spend_total

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [47]:
# Get the average spend per player
avg_spend = spend_total/spend_count
avg_spend = avg_spend.to_frame()
avg_spend.head()

                 0
SN
Adairialis76  2.28
Adastirin33   4.48
Aeda94        4.91
Aela59        4.32
Aelaria33     1.79

In [48]:
# Merge columns two at a time
spend_summary = pd.merge(spend_count, avg_spend, on="SN")
spend_summary.head()

              Purchase ID     0
SN
Adairialis76            1  2.28
Adastirin33             1  4.48
Aeda94                  1  4.91
Aela59                  1  4.32
Aelaria33               1  1.79

In [49]:
# Next merge
spend_summary_merge = pd.merge(spend_summary, spend_total, on="SN")
spend_summary_merge.head()

              Purchase ID     0  Price
SN
Adairialis76            1  2.28   2.28
Adastirin33             1  4.48   4.48
Aeda94                  1  4.91   4.91
Aela59                  1  4.32   4.32
Aelaria33               1  1.79   1.79

In [50]:
# Rename columns
spend_analysis = spend_summary_merge.rename(columns={"Purchase ID": "Purchase Count", 
                                                       0: "Avg Purchase Price",
                                                     "Price": "Total Purchase Value"})
spend_analysis.head()

              Purchase Count  Avg Purchase Price  Total Purchase Value
SN
Adairialis76               1                2.28                  2.28
Adastirin33                1                4.48                  4.48
Aeda94                     1                4.91                  4.91
Aela59                     1                4.32                  4.32
Aelaria33                  1                1.79                  1.79

In [51]:
# Sort by total purchase value in descending order to get highest total purchase value
top_spend_analysis = spend_analysis.sort_values("Total Purchase Value", ascending=False)
top_spend_analysis.head()

             Purchase Count  Avg Purchase Price  Total Purchase Value
SN
Lisosia93                 5            3.792000                 18.96
Idastidru52               4            3.862500                 15.45
Chamjask73                3            4.610000                 13.83
Iral74                    4            3.405000                 13.62
Iskadarya95               3            4.366667                 13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [52]:
# Retrieve Item ID, Item Name, and Item Price colums
popular_items_df = purchase_data[["Item ID", "Item Name", "Price"]]
popular_items_df.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [53]:
# Group by Item ID and Item Name
popular_items_group = popular_items_df.groupby(["Item ID", "Item Name"])

# Obtain purchase count
popular_items_count = popular_items_group["Item ID"].count()
popular_items_count.head()

Item ID  Item Name
0        Splinter              4
1        Crucifer              4
2        Verdict               6
3        Phantomlight          6
4        Bloodlord's Fetish    5
Name: Item ID, dtype: int64

In [54]:
# Convert to dataframe then rename count column to remove two "Item ID" columns
popular_items_count = pd.DataFrame(popular_items_count)
popular_items_count.head()
popular_items_table = popular_items_count.rename(columns={"Item ID": "Purchase Count"})
popular_items_table.head()

                            Purchase Count
Item ID Item Name
0       Splinter                         4
1       Crucifer                         4
2       Verdict                          6
3       Phantomlight                     6
4       Bloodlord's Fetish               5

In [55]:
# Sum up total price of each item
popular_total_price = popular_items_group["Price"].sum()
popular_total_price.head()

Item ID  Item Name
0        Splinter               5.12
1        Crucifer              11.77
2        Verdict               14.88
3        Phantomlight          14.94
4        Bloodlord's Fetish     8.50
Name: Price, dtype: float64

In [56]:
# Get average price of each item
popular_avg_price = popular_items_group["Price"].mean()
popular_avg_price.head()

Item ID  Item Name
0        Splinter              1.2800
1        Crucifer              2.9425
2        Verdict               2.4800
3        Phantomlight          2.4900
4        Bloodlord's Fetish    1.7000
Name: Price, dtype: float64

In [57]:
# Merge two at a time
popular_items_summary = pd.merge(popular_items_table, popular_avg_price, on=("Item ID", "Item Name"), how="outer")
popular_items_summary.head()

                            Purchase Count   Price
Item ID Item Name
0       Splinter                         4  1.2800
1       Crucifer                         4  2.9425
2       Verdict                          6  2.4800
3       Phantomlight                     6  2.4900
4       Bloodlord's Fetish               5  1.7000

In [58]:
# Next merge to get complet table
popular_items_summary2 = pd.merge(popular_items_summary, popular_total_price, on=("Item ID", "Item Name"), 
                                  how="outer")
popular_items_summary2.head()

                            Purchase Count  Price_x  Price_y
Item ID Item Name
0       Splinter                         4   1.2800     5.12
1       Crucifer                         4   2.9425    11.77
2       Verdict                          6   2.4800    14.88
3       Phantomlight                     6   2.4900    14.94
4       Bloodlord's Fetish               5   1.7000     8.50

In [59]:
# Rename columns and clean up table
popular_items_table = popular_items_summary2.rename(columns={"Price_x": "Item Price",
                                                      "Price_y": "Total Purchase Value"})
popular_items_table.head()

                            Purchase Count  Item Price  Total Purchase Value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50

In [60]:
# Sort table by Total Purchase Count
popular_items_analysis = popular_items_table.sort_values("Purchase Count", ascending=False)
popular_items_analysis.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [61]:
# Sort table by Total Purchase Value
popular_items_analysis = popular_items_table.sort_values("Total Purchase Value", ascending=False)
popular_items_analysis.head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80